
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |   🟡 Change |   🔴 Destroy |
|:---------:|--------:|-----------:|------------:|
|     ✅     |       2 |          1 |           2 |
## Affected resources by action

|  Action  | Resources                                                    |
|:--------:|:-------------------------------------------------------------|
|    🟡     | `module.jumphost.aws_lambda_function.update_dns`             |
|    🟡     | `module.jumphost.null_resource.install_python_dependencies:` |
<details>
<summary>STDOUT</summary>

```[command]/home/runner/work/_temp/d5c0a994-c89f-4c6f-b327-2719e96985c7/terraform-bin plan -no-color --out=tf.plan
module.jumphost.null_resource.install_python_dependencies: Refreshing state... [id=8897413075953153488]
module.jumphost.random_uuid.lamda_src_hash: Refreshing state... [id=eb1c6bbc-5640-62f5-93ef-3f0ab8bddc4f]
module.infrahouse_com.aws_route53_zone.infrahouse_com: Refreshing state... [id=Z07662251LH3YRF2ERM3G]
module.jumphost.data.aws_ami.ubuntu_22: Reading...
aws_key_pair.aleks: Refreshing state... [id=aleks]
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-permissions: Reading...
data.aws_iam_policy.administrator-access: Reading...
module.jumphost.module.jumphost_profile.data.aws_iam_policy_document.assume: Reading...
module.jumphost.data.aws_iam_policy_document.assume_role: Reading...
data.aws_availability_zones.uw1: Reading...
module.jumphost.data.aws_iam_policy_document.jumphost_permissions: Reading...
module.github-connector.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::493370826424:oidc-provider/token.actions.githubusercontent.com]
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=3894068826]
module.jumphost.module.jumphost_profile.data.aws_iam_policy_document.assume: Read complete after 0s [id=1903849331]
module.jumphost.data.aws_iam_policy_document.jumphost_permissions: Read complete after 0s [id=1152265192]
module.jumphost.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=3693445097]
module.jumphost.data.aws_iam_policy.AWSLambdaBasicExecutionRole: Reading...
data.aws_ami.ubuntu_22: Reading...
module.jumphost.aws_s3_bucket.lambda_tmp: Refreshing state... [id=infrahouse-jumphost-lambda-20230713233459675800000001]
module.jumphost.data.aws_caller_identity.current: Reading...
module.jumphost.data.aws_caller_identity.current: Read complete after 0s [id=493370826424]
module.jumphost.data.aws_region.current: Reading...
module.jumphost.data.aws_region.current: Read complete after 0s [id=us-west-1]
module.management.aws_vpc.vpc: Refreshing state... [id=vpc-08e19d859c26d18b2]
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy.administrator-access: Reading...
module.jumphost.module.jumphost_profile.aws_iam_role.profile: Refreshing state... [id=jumphost20230710043044761000000002]
module.jumphost.aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
data.aws_availability_zones.uw1: Read complete after 0s [id=us-west-1]
module.infrahouse_com.aws_route53_record.txt_dkim: Refreshing state... [id=Z07662251LH3YRF2ERM3G_google._domainkey.infrahouse.com_TXT]
data.aws_ami.ubuntu_22: Read complete after 0s [id=ami-0793452df88d33c63]
module.infrahouse_com.aws_route53_record.spf: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_SPF]
module.infrahouse_com.aws_route53_record.mx: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_MX]
module.jumphost.data.aws_ami.ubuntu_22: Read complete after 0s [id=ami-0793452df88d33c63]
module.infrahouse_com.aws_route53_record.txt_spf: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_TXT]
module.jumphost.module.jumphost_profile.aws_iam_policy.profile: Refreshing state... [id=arn:aws:iam::493370826424:policy/jumphost20230710043044760400000001]
module.jumphost.module.jumphost_profile.aws_iam_instance_profile.profile: Refreshing state... [id=jumphost]
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-assume: Reading...
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=3911844868]
module.jumphost.module.jumphost_profile.aws_iam_role_policy_attachment.jumphost: Refreshing state... [id=jumphost20230710043044761000000002-20230710043045781100000003]
module.management.aws_eip.nat_eip["10.0.0.0/24"]: Refreshing state... [id=eipalloc-02b42e70d52a5db7f]
module.management.aws_eip.nat_eip["10.0.2.0/24"]: Refreshing state... [id=eipalloc-016035246b49102b5]
module.ih-tf-aws-control-493370826424-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-aws-control-493370826424-github]
module.jumphost.aws_launch_template.jumphost: Refreshing state... [id=lt-01a8ef96822b4b00b]
module.jumphost.data.aws_iam_policy.AWSLambdaBasicExecutionRole: Read complete after 0s [id=arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]
module.jumphost.aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole: Refreshing state... [id=iam_for_lambda-20230710175434878000000001]
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.admin-assume: Reading...
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=1382937169]
module.ih-tf-aws-control-493370826424-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-aws-control-493370826424-admin]
data.aws_iam_policy.administrator-access: Read complete after 0s [id=arn:aws:iam::aws:policy/AdministratorAccess]
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy.administrator-access: Read complete after 0s [id=arn:aws:iam::aws:policy/AdministratorAccess]
module.ih-tf-aws-control-493370826424-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-aws-control-493370826424-admin-20230709164321319900000001]
module.management.aws_subnet.all["10.0.3.0/24"]: Refreshing state... [id=subnet-0cfffaca325d93827]
module.management.aws_route_table.all["10.0.0.0/24"]: Refreshing state... [id=rtb-04a16e74d5b12a338]
module.management.aws_route_table.all["10.0.3.0/24"]: Refreshing state... [id=rtb-0178e1718deba51ce]
module.management.aws_subnet.all["10.0.1.0/24"]: Refreshing state... [id=subnet-0f91dd2675e7a16c3]
module.management.aws_subnet.all["10.0.0.0/24"]: Refreshing state... [id=subnet-0df885dcc99418799]
module.management.aws_internet_gateway.ig: Refreshing state... [id=igw-079090e09ed5db582]
module.management.aws_default_security_group.default: Refreshing state... [id=sg-08b960b85f5996100]
module.management.aws_subnet.all["10.0.2.0/24"]: Refreshing state... [id=subnet-083e969dc3779af26]
module.management.aws_default_route_table.default: Refreshing state... [id=rtb-0d73383afeb6ad142]
module.management.aws_route_table.all["10.0.1.0/24"]: Refreshing state... [id=rtb-067c30e65dd4108e9]
module.management.aws_route_table.all["10.0.2.0/24"]: Refreshing state... [id=rtb-0bc6c44c1b26fed22]
module.jumphost.aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-jumphost-lambda-20230713233459675800000001]
module.jumphost.aws_s3_object.lambda_package: Refreshing state... [id=eb1c6bbc-5640-62f5-93ef-3f0ab8bddc4f.zip]
module.jumphost.aws_lambda_function.update_dns: Refreshing state... [id=update_dns]
module.management.aws_route.default_main: Refreshing state... [id=r-rtb-0d73383afeb6ad1421080289494]
module.management.aws_nat_gateway.nat_gw["10.0.2.0/24"]: Refreshing state... [id=nat-08b1cd06b043099ec]
module.jumphost.aws_autoscaling_group.jumphost: Refreshing state... [id=jumphost-20230710045512165400000001]
module.management.aws_nat_gateway.nat_gw["10.0.0.0/24"]: Refreshing state... [id=nat-08fb9b52683277947]
module.management.aws_route_table_association.private_rt_assoc["10.0.2.0/24"]: Refreshing state... [id=rtbassoc-0e795bdaee627aa6c]
module.management.aws_route_table_association.private_rt_assoc["10.0.0.0/24"]: Refreshing state... [id=rtbassoc-08a410160e2dcc592]
module.management.aws_route_table_association.private_rt_assoc["10.0.1.0/24"]: Refreshing state... [id=rtbassoc-099b958af19485f2b]
module.management.aws_route_table_association.private_rt_assoc["10.0.3.0/24"]: Refreshing state... [id=rtbassoc-0bf278b6a394aed44]
module.management.aws_route.subnet_public["10.0.0.0/24"]: Refreshing state... [id=r-rtb-04a16e74d5b12a3381080289494]
module.management.aws_route.subnet_public["10.0.2.0/24"]: Refreshing state... [id=r-rtb-0bc6c44c1b26fed221080289494]
module.management.aws_route.subnet_private["10.0.1.0/24"]: Refreshing state... [id=r-rtb-067c30e65dd4108e91080289494]
module.management.aws_route.subnet_private["10.0.3.0/24"]: Refreshing state... [id=r-rtb-0178e1718deba51ce1080289494]
module.jumphost.aws_cloudwatch_event_rule.scale: Refreshing state... [id=jumphost-scale20230711172747504700000001]
module.jumphost.data.aws_iam_policy_document.lambda-permissions: Reading...
module.jumphost.aws_autoscaling_lifecycle_hook.launching: Refreshing state... [id=launching]
module.jumphost.aws_autoscaling_lifecycle_hook.terminating: Refreshing state... [id=terminating]
module.jumphost.data.aws_iam_policy_document.lambda-permissions: Read complete after 0s [id=505280429]
module.jumphost.aws_iam_policy.lambda_permissions: Refreshing state... [id=arn:aws:iam::493370826424:policy/lambda_permissions20230711160512724200000001]
module.jumphost.aws_cloudwatch_log_group.update_dns: Refreshing state... [id=/aws/lambda/update_dns]
module.jumphost.aws_iam_role_policy_attachment.lambda_permissions: Refreshing state... [id=iam_for_lambda-20230711160513416100000002]
module.jumphost.aws_lambda_permission.allow_cloudwatch: Refreshing state... [id=AllowExecutionFromCloudWatch-out]
module.jumphost.aws_cloudwatch_event_target.scale-out: Refreshing state... [id=jumphost-scale20230711172747504700000001-terraform-20230711172747630900000002]
module.jumphost.data.aws_iam_policy_document.lambda_logging: Reading...
module.jumphost.data.aws_iam_policy_document.lambda_logging: Read complete after 0s [id=2267145382]
module.jumphost.aws_iam_policy.lambda_logging: Refreshing state... [id=arn:aws:iam::493370826424:policy/lambda_logging20230711160513778300000003]
module.jumphost.aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=iam_for_lambda-20230711160514251100000004]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.jumphost.data.archive_file.lambda will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "lambda" {
      + excludes            = [
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "modules/jumphost/eb1c6bbc-5640-62f5-93ef-3f0ab8bddc4f.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "modules/jumphost/update_dns"
      + type                = "zip"
    }

  # module.jumphost.aws_lambda_function.update_dns will be updated in-place
  ~ resource "aws_lambda_function" "update_dns" {
        id                             = "update_dns"
      ~ last_modified                  = "2023-07-16T00:32:13.000+0000" -> (known after apply)
      ~ s3_key                         = "775ec676-d2c4-488e-4129-47bc39c4c417.zip" -> "eb1c6bbc-5640-62f5-93ef-3f0ab8bddc4f.zip"
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.jumphost.aws_s3_object.lambda_package is tainted, so must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "d9c9e5af647ce6edaf2dcf1289f7a294-3" -> (known after apply)
      ~ id                     = "eb1c6bbc-5640-62f5-93ef-3f0ab8bddc4f.zip" -> (known after apply)
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      + version_id             = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.jumphost.null_resource.install_python_dependencies is tainted, so must be replaced
-/+ resource "null_resource" "install_python_dependencies" {
      ~ id       = "8897413075953153488" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
Releasing state lock. This may take a few moments...
::debug::Terraform exited with code 0.
::debug::stdout: module.jumphost.null_resource.install_python_dependencies: Refreshing state... [id=8897413075953153488]%0Amodule.jumphost.random_uuid.lamda_src_hash: Refreshing state... [id=eb1c6bbc-5640-62f5-93ef-3f0ab8bddc4f]%0Amodule.infrahouse_com.aws_route53_zone.infrahouse_com: Refreshing state... [id=Z07662251LH3YRF2ERM3G]%0Amodule.jumphost.data.aws_ami.ubuntu_22: Reading...%0Aaws_key_pair.aleks: Refreshing state... [id=aleks]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-permissions: Reading...%0Adata.aws_iam_policy.administrator-access: Reading...%0Amodule.jumphost.module.jumphost_profile.data.aws_iam_policy_document.assume: Reading...%0Amodule.jumphost.data.aws_iam_policy_document.assume_role: Reading...%0Adata.aws_availability_zones.uw1: Reading...%0Amodule.jumphost.data.aws_iam_policy_document.jumphost_permissions: Reading...%0Amodule.github-connector.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::493370826424:oidc-provider/token.actions.githubusercontent.com]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=3894068826]%0Amodule.jumphost.module.jumphost_profile.data.aws_iam_policy_document.assume: Read complete after 0s [id=1903849331]%0Amodule.jumphost.data.aws_iam_policy_document.jumphost_permissions: Read complete after 0s [id=1152265192]%0Amodule.jumphost.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=3693445097]%0Amodule.jumphost.data.aws_iam_policy.AWSLambdaBasicExecutionRole: Reading...%0Adata.aws_ami.ubuntu_22: Reading...%0Amodule.jumphost.aws_s3_bucket.lambda_tmp: Refreshing state... [id=infrahouse-jumphost-lambda-20230713233459675800000001]%0Amodule.jumphost.data.aws_caller_identity.current: Reading...%0Amodule.jumphost.data.aws_caller_identity.current: Read complete after 0s [id=493370826424]%0Amodule.jumphost.data.aws_region.current: Reading...%0Amodule.jumphost.data.aws_region.current: Read complete after 0s [id=us-west-1]%0Amodule.management.aws_vpc.vpc: Refreshing state... [id=vpc-08e19d859c26d18b2]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy.administrator-access: Reading...%0Amodule.jumphost.module.jumphost_profile.aws_iam_role.profile: Refreshing state... [id=jumphost20230710043044761000000002]%0Amodule.jumphost.aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]%0Adata.aws_availability_zones.uw1: Read complete after 0s [id=us-west-1]%0Amodule.infrahouse_com.aws_route53_record.txt_dkim: Refreshing state... [id=Z07662251LH3YRF2ERM3G_google._domainkey.infrahouse.com_TXT]%0Adata.aws_ami.ubuntu_22: Read complete after 0s [id=ami-0793452df88d33c63]%0Amodule.infrahouse_com.aws_route53_record.spf: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_SPF]%0Amodule.infrahouse_com.aws_route53_record.mx: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_MX]%0Amodule.jumphost.data.aws_ami.ubuntu_22: Read complete after 0s [id=ami-0793452df88d33c63]%0Amodule.infrahouse_com.aws_route53_record.txt_spf: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_TXT]%0Amodule.jumphost.module.jumphost_profile.aws_iam_policy.profile: Refreshing state... [id=arn:aws:iam::493370826424:policy/jumphost20230710043044760400000001]%0Amodule.jumphost.module.jumphost_profile.aws_iam_instance_profile.profile: Refreshing state... [id=jumphost]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-assume: Reading...%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=3911844868]%0Amodule.jumphost.module.jumphost_profile.aws_iam_role_policy_attachment.jumphost: Refreshing state... [id=jumphost20230710043044761000000002-20230710043045781100000003]%0Amodule.management.aws_eip.nat_eip["10.0.0.0/24"]: Refreshing state... [id=eipalloc-02b42e70d52a5db7f]%0Amodule.management.aws_eip.nat_eip["10.0.2.0/24"]: Refreshing state... [id=eipalloc-016035246b49102b5]%0Amodule.ih-tf-aws-control-493370826424-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-aws-control-493370826424-github]%0Amodule.jumphost.aws_launch_template.jumphost: Refreshing state... [id=lt-01a8ef96822b4b00b]%0Amodule.jumphost.data.aws_iam_policy.AWSLambdaBasicExecutionRole: Read complete after 0s [id=arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]%0Amodule.jumphost.aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole: Refreshing state... [id=iam_for_lambda-20230710175434878000000001]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.admin-assume: Reading...%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=1382937169]%0Amodule.ih-tf-aws-control-493370826424-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-aws-control-493370826424-admin]%0Adata.aws_iam_policy.administrator-access: Read complete after 0s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy.administrator-access: Read complete after 0s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.ih-tf-aws-control-493370826424-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-aws-control-493370826424-admin-20230709164321319900000001]%0Amodule.management.aws_subnet.all["10.0.3.0/24"]: Refreshing state... [id=subnet-0cfffaca325d93827]%0Amodule.management.aws_route_table.all["10.0.0.0/24"]: Refreshing state... [id=rtb-04a16e74d5b12a338]%0Amodule.management.aws_route_table.all["10.0.3.0/24"]: Refreshing state... [id=rtb-0178e1718deba51ce]%0Amodule.management.aws_subnet.all["10.0.1.0/24"]: Refreshing state... [id=subnet-0f91dd2675e7a16c3]%0Amodule.management.aws_subnet.all["10.0.0.0/24"]: Refreshing state... [id=subnet-0df885dcc99418799]%0Amodule.management.aws_internet_gateway.ig: Refreshing state... [id=igw-079090e09ed5db582]%0Amodule.management.aws_default_security_group.default: Refreshing state... [id=sg-08b960b85f5996100]%0Amodule.management.aws_subnet.all["10.0.2.0/24"]: Refreshing state... [id=subnet-083e969dc3779af26]%0Amodule.management.aws_default_route_table.default: Refreshing state... [id=rtb-0d73383afeb6ad142]%0Amodule.management.aws_route_table.all["10.0.1.0/24"]: Refreshing state... [id=rtb-067c30e65dd4108e9]%0Amodule.management.aws_route_table.all["10.0.2.0/24"]: Refreshing state... [id=rtb-0bc6c44c1b26fed22]%0Amodule.jumphost.aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-jumphost-lambda-20230713233459675800000001]%0Amodule.jumphost.aws_s3_object.lambda_package: Refreshing state... [id=eb1c6bbc-5640-62f5-93ef-3f0ab8bddc4f.zip]%0Amodule.jumphost.aws_lambda_function.update_dns: Refreshing state... [id=update_dns]%0Amodule.management.aws_route.default_main: Refreshing state... [id=r-rtb-0d73383afeb6ad1421080289494]%0Amodule.management.aws_nat_gateway.nat_gw["10.0.2.0/24"]: Refreshing state... [id=nat-08b1cd06b043099ec]%0Amodule.jumphost.aws_autoscaling_group.jumphost: Refreshing state... [id=jumphost-20230710045512165400000001]%0Amodule.management.aws_nat_gateway.nat_gw["10.0.0.0/24"]: Refreshing state... [id=nat-08fb9b52683277947]%0Amodule.management.aws_route_table_association.private_rt_assoc["10.0.2.0/24"]: Refreshing state... [id=rtbassoc-0e795bdaee627aa6c]%0Amodule.management.aws_route_table_association.private_rt_assoc["10.0.0.0/24"]: Refreshing state... [id=rtbassoc-08a410160e2dcc592]%0Amodule.management.aws_route_table_association.private_rt_assoc["10.0.1.0/24"]: Refreshing state... [id=rtbassoc-099b958af19485f2b]%0Amodule.management.aws_route_table_association.private_rt_assoc["10.0.3.0/24"]: Refreshing state... [id=rtbassoc-0bf278b6a394aed44]%0Amodule.management.aws_route.subnet_public["10.0.0.0/24"]: Refreshing state... [id=r-rtb-04a16e74d5b12a3381080289494]%0Amodule.management.aws_route.subnet_public["10.0.2.0/24"]: Refreshing state... [id=r-rtb-0bc6c44c1b26fed221080289494]%0Amodule.management.aws_route.subnet_private["10.0.1.0/24"]: Refreshing state... [id=r-rtb-067c30e65dd4108e91080289494]%0Amodule.management.aws_route.subnet_private["10.0.3.0/24"]: Refreshing state... [id=r-rtb-0178e1718deba51ce1080289494]%0Amodule.jumphost.aws_cloudwatch_event_rule.scale: Refreshing state... [id=jumphost-scale20230711172747504700000001]%0Amodule.jumphost.data.aws_iam_policy_document.lambda-permissions: Reading...%0Amodule.jumphost.aws_autoscaling_lifecycle_hook.launching: Refreshing state... [id=launching]%0Amodule.jumphost.aws_autoscaling_lifecycle_hook.terminating: Refreshing state... [id=terminating]%0Amodule.jumphost.data.aws_iam_policy_document.lambda-permissions: Read complete after 0s [id=505280429]%0Amodule.jumphost.aws_iam_policy.lambda_permissions: Refreshing state... [id=arn:aws:iam::493370826424:policy/lambda_permissions20230711160512724200000001]%0Amodule.jumphost.aws_cloudwatch_log_group.update_dns: Refreshing state... [id=/aws/lambda/update_dns]%0Amodule.jumphost.aws_iam_role_policy_attachment.lambda_permissions: Refreshing state... [id=iam_for_lambda-20230711160513416100000002]%0Amodule.jumphost.aws_lambda_permission.allow_cloudwatch: Refreshing state... [id=AllowExecutionFromCloudWatch-out]%0Amodule.jumphost.aws_cloudwatch_event_target.scale-out: Refreshing state... [id=jumphost-scale20230711172747504700000001-terraform-20230711172747630900000002]%0Amodule.jumphost.data.aws_iam_policy_document.lambda_logging: Reading...%0Amodule.jumphost.data.aws_iam_policy_document.lambda_logging: Read complete after 0s [id=2267145382]%0Amodule.jumphost.aws_iam_policy.lambda_logging: Refreshing state... [id=arn:aws:iam::493370826424:policy/lambda_logging20230711160513778300000003]%0Amodule.jumphost.aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=iam_for_lambda-20230711160514251100000004]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # module.jumphost.data.archive_file.lambda will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "archive_file" "lambda" {%0A      + excludes            = [%0A          + "__pycache__",%0A        ]%0A      + id                  = (known after apply)%0A      + output_base64sha256 = (known after apply)%0A      + output_base64sha512 = (known after apply)%0A      + output_md5          = (known after apply)%0A      + output_path         = "modules/jumphost/eb1c6bbc-5640-62f5-93ef-3f0ab8bddc4f.zip"%0A      + output_sha          = (known after apply)%0A      + output_sha256       = (known after apply)%0A      + output_sha512       = (known after apply)%0A      + output_size         = (known after apply)%0A      + source_dir          = "modules/jumphost/update_dns"%0A      + type                = "zip"%0A    }%0A%0A  # module.jumphost.aws_lambda_function.update_dns will be updated in-place%0A  ~ resource "aws_lambda_function" "update_dns" {%0A        id                             = "update_dns"%0A      ~ last_modified                  = "2023-07-16T00:32:13.000+0000" -> (known after apply)%0A      ~ s3_key                         = "775ec676-d2c4-488e-4129-47bc39c4c417.zip" -> "eb1c6bbc-5640-62f5-93ef-3f0ab8bddc4f.zip"%0A        tags                           = {}%0A        # (21 unchanged attributes hidden)%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0A  # module.jumphost.aws_s3_object.lambda_package is tainted, so must be replaced%0A-/+ resource "aws_s3_object" "lambda_package" {%0A      ~ bucket_key_enabled     = false -> (known after apply)%0A      ~ content_type           = "binary/octet-stream" -> (known after apply)%0A      ~ etag                   = "d9c9e5af647ce6edaf2dcf1289f7a294-3" -> (known after apply)%0A      ~ id                     = "eb1c6bbc-5640-62f5-93ef-3f0ab8bddc4f.zip" -> (known after apply)%0A      + kms_key_id             = (known after apply)%0A      - metadata               = {} -> null%0A      ~ server_side_encryption = "AES256" -> (known after apply)%0A      ~ storage_class          = "STANDARD" -> (known after apply)%0A      - tags                   = {} -> null%0A      + version_id             = (known after apply)%0A        # (6 unchanged attributes hidden)%0A    }%0A%0A  # module.jumphost.null_resource.install_python_dependencies is tainted, so must be replaced%0A-/+ resource "null_resource" "install_python_dependencies" {%0A      ~ id       = "8897413075953153488" -> (known after apply)%0A        # (1 unchanged attribute hidden)%0A    }%0A%0APlan: 2 to add, 1 to change, 2 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0AReleasing state lock. This may take a few moments...%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgInN0ZG91dCI6ICJbY29tbWFuZF0vaG9tZS9ydW5uZXIvd29yay9fdGVtcC9kNWMwYTk5NC1jODlmLTRjNmYtYjMyNy0yNzE5ZTk2OTg1YzcvdGVycmFmb3JtLWJpbiBwbGFuIC1uby1jb2xvciAtLW91dD10Zi5wbGFuXG5tb2R1bGUuanVtcGhvc3QubnVsbF9yZXNvdXJjZS5pbnN0YWxsX3B5dGhvbl9kZXBlbmRlbmNpZXM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTg4OTc0MTMwNzU5NTMxNTM0ODhdXG5tb2R1bGUuanVtcGhvc3QucmFuZG9tX3V1aWQubGFtZGFfc3JjX2hhc2g6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWViMWM2YmJjLTU2NDAtNjJmNS05M2VmLTNmMGFiOGJkZGM0Zl1cbm1vZHVsZS5pbmZyYWhvdXNlX2NvbS5hd3Nfcm91dGU1M196b25lLmluZnJhaG91c2VfY29tOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0ddXG5tb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfYW1pLnVidW50dV8yMjogUmVhZGluZy4uLlxuYXdzX2tleV9wYWlyLmFsZWtzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hbGVrc11cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItcGVybWlzc2lvbnM6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWRpbmcuLi5cbm1vZHVsZS5qdW1waG9zdC5tb2R1bGUuanVtcGhvc3RfcHJvZmlsZS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZGluZy4uLlxubW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lX3JvbGU6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2F2YWlsYWJpbGl0eV96b25lcy51dzE6IFJlYWRpbmcuLi5cbm1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50Lmp1bXBob3N0X3Blcm1pc3Npb25zOiBSZWFkaW5nLi4uXG5tb2R1bGUuZ2l0aHViLWNvbm5lY3Rvci5hd3NfaWFtX29wZW5pZF9jb25uZWN0X3Byb3ZpZGVyLmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjQ5MzM3MDgyNjQyNDpvaWRjLXByb3ZpZGVyL3Rva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9Mzg5NDA2ODgyNl1cbm1vZHVsZS5qdW1waG9zdC5tb2R1bGUuanVtcGhvc3RfcHJvZmlsZS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTkwMzg0OTMzMV1cbm1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50Lmp1bXBob3N0X3Blcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xMTUyMjY1MTkyXVxubW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lX3JvbGU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTM2OTM0NDUwOTddXG5tb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfaWFtX3BvbGljeS5BV1NMYW1iZGFCYXNpY0V4ZWN1dGlvblJvbGU6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2FtaS51YnVudHVfMjI6IFJlYWRpbmcuLi5cbm1vZHVsZS5qdW1waG9zdC5hd3NfczNfYnVja2V0LmxhbWJkYV90bXA6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtanVtcGhvc3QtbGFtYmRhLTIwMjMwNzEzMjMzNDU5Njc1ODAwMDAwMDAxXVxubW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2NhbGxlcl9pZGVudGl0eS5jdXJyZW50OiBSZWFkaW5nLi4uXG5tb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfY2FsbGVyX2lkZW50aXR5LmN1cnJlbnQ6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQ5MzM3MDgyNjQyNF1cbm1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19yZWdpb24uY3VycmVudDogUmVhZGluZy4uLlxubW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX3JlZ2lvbi5jdXJyZW50OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD11cy13ZXN0LTFdXG5tb2R1bGUubWFuYWdlbWVudC5hd3NfdnBjLnZwYzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dnBjLTA4ZTE5ZDg1OWMyNmQxOGIyXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkaW5nLi4uXG5tb2R1bGUuanVtcGhvc3QubW9kdWxlLmp1bXBob3N0X3Byb2ZpbGUuYXdzX2lhbV9yb2xlLnByb2ZpbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWp1bXBob3N0MjAyMzA3MTAwNDMwNDQ3NjEwMDAwMDAwMDJdXG5tb2R1bGUuanVtcGhvc3QuYXdzX2lhbV9yb2xlLmlhbV9mb3JfbGFtYmRhOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pYW1fZm9yX2xhbWJkYV1cbmRhdGEuYXdzX2F2YWlsYWJpbGl0eV96b25lcy51dzE6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPXVzLXdlc3QtMV1cbm1vZHVsZS5pbmZyYWhvdXNlX2NvbS5hd3Nfcm91dGU1M19yZWNvcmQudHh0X2RraW06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR19nb29nbGUuX2RvbWFpbmtleS5pbmZyYWhvdXNlLmNvbV9UWFRdXG5kYXRhLmF3c19hbWkudWJ1bnR1XzIyOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hbWktMDc5MzQ1MmRmODhkMzNjNjNdXG5tb2R1bGUuaW5mcmFob3VzZV9jb20uYXdzX3JvdXRlNTNfcmVjb3JkLnNwZjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHX2luZnJhaG91c2UuY29tX1NQRl1cbm1vZHVsZS5pbmZyYWhvdXNlX2NvbS5hd3Nfcm91dGU1M19yZWNvcmQubXg6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR19pbmZyYWhvdXNlLmNvbV9NWF1cbm1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19hbWkudWJ1bnR1XzIyOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hbWktMDc5MzQ1MmRmODhkMzNjNjNdXG5tb2R1bGUuaW5mcmFob3VzZV9jb20uYXdzX3JvdXRlNTNfcmVjb3JkLnR4dF9zcGY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR19pbmZyYWhvdXNlLmNvbV9UWFRdXG5tb2R1bGUuanVtcGhvc3QubW9kdWxlLmp1bXBob3N0X3Byb2ZpbGUuYXdzX2lhbV9wb2xpY3kucHJvZmlsZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjQ5MzM3MDgyNjQyNDpwb2xpY3kvanVtcGhvc3QyMDIzMDcxMDA0MzA0NDc2MDQwMDAwMDAwMV1cbm1vZHVsZS5qdW1waG9zdC5tb2R1bGUuanVtcGhvc3RfcHJvZmlsZS5hd3NfaWFtX2luc3RhbmNlX3Byb2ZpbGUucHJvZmlsZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9anVtcGhvc3RdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLWFzc3VtZTogUmVhZGluZy4uLlxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTM5MTE4NDQ4NjhdXG5tb2R1bGUuanVtcGhvc3QubW9kdWxlLmp1bXBob3N0X3Byb2ZpbGUuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50Lmp1bXBob3N0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1qdW1waG9zdDIwMjMwNzEwMDQzMDQ0NzYxMDAwMDAwMDAyLTIwMjMwNzEwMDQzMDQ1NzgxMTAwMDAwMDAzXVxubW9kdWxlLm1hbmFnZW1lbnQuYXdzX2VpcC5uYXRfZWlwW1wiMTAuMC4wLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWVpcGFsbG9jLTAyYjQyZTcwZDUyYTVkYjdmXVxubW9kdWxlLm1hbmFnZW1lbnQuYXdzX2VpcC5uYXRfZWlwW1wiMTAuMC4yLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWVpcGFsbG9jLTAxNjAzNTI0NmI0OTEwMmI1XVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5hd3NfaWFtX3JvbGUuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtZ2l0aHViXVxubW9kdWxlLmp1bXBob3N0LmF3c19sYXVuY2hfdGVtcGxhdGUuanVtcGhvc3Q6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWx0LTAxYThlZjk2ODIyYjRiMDBiXVxubW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3kuQVdTTGFtYmRhQmFzaWNFeGVjdXRpb25Sb2xlOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9zZXJ2aWNlLXJvbGUvQVdTTGFtYmRhQmFzaWNFeGVjdXRpb25Sb2xlXVxubW9kdWxlLmp1bXBob3N0LmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5BV1NMYW1iZGFCYXNpY0V4ZWN1dGlvblJvbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWlhbV9mb3JfbGFtYmRhLTIwMjMwNzEwMTc1NDM0ODc4MDAwMDAwMDAxXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLWFzc3VtZTogUmVhZGluZy4uLlxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTM4MjkzNzE2OV1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uYXdzX2lhbV9yb2xlLmFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW5dXG5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9BZG1pbmlzdHJhdG9yQWNjZXNzXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9BZG1pbmlzdHJhdG9yQWNjZXNzXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuYWRtaW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi0yMDIzMDcwOTE2NDMyMTMxOTkwMDAwMDAwMV1cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19zdWJuZXQuYWxsW1wiMTAuMC4zLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXN1Ym5ldC0wY2ZmZmFjYTMyNWQ5MzgyN11cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZV90YWJsZS5hbGxbXCIxMC4wLjAuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiLTA0YTE2ZTc0ZDViMTJhMzM4XVxubW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlX3RhYmxlLmFsbFtcIjEwLjAuMy4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMDE3OGUxNzE4ZGViYTUxY2VdXG5tb2R1bGUubWFuYWdlbWVudC5hd3Nfc3VibmV0LmFsbFtcIjEwLjAuMS4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zdWJuZXQtMGY5MWRkMjY3NWU3YTE2YzNdXG5tb2R1bGUubWFuYWdlbWVudC5hd3Nfc3VibmV0LmFsbFtcIjEwLjAuMC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zdWJuZXQtMGRmODg1ZGNjOTk0MTg3OTldXG5tb2R1bGUubWFuYWdlbWVudC5hd3NfaW50ZXJuZXRfZ2F0ZXdheS5pZzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWd3LTA3OTA5MGUwOWVkNWRiNTgyXVxubW9kdWxlLm1hbmFnZW1lbnQuYXdzX2RlZmF1bHRfc2VjdXJpdHlfZ3JvdXAuZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2ctMDhiOTYwYjg1ZjU5OTYxMDBdXG5tb2R1bGUubWFuYWdlbWVudC5hd3Nfc3VibmV0LmFsbFtcIjEwLjAuMi4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zdWJuZXQtMDgzZTk2OWRjMzc3OWFmMjZdXG5tb2R1bGUubWFuYWdlbWVudC5hd3NfZGVmYXVsdF9yb3V0ZV90YWJsZS5kZWZhdWx0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMGQ3MzM4M2FmZWI2YWQxNDJdXG5tb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGVfdGFibGUuYWxsW1wiMTAuMC4xLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0Yi0wNjdjMzBlNjVkZDQxMDhlOV1cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZV90YWJsZS5hbGxbXCIxMC4wLjIuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiLTBiYzZjNDRjMWIyNmZlZDIyXVxubW9kdWxlLmp1bXBob3N0LmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5wdWJsaWNfYWNjZXNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWp1bXBob3N0LWxhbWJkYS0yMDIzMDcxMzIzMzQ1OTY3NTgwMDAwMDAwMV1cbm1vZHVsZS5qdW1waG9zdC5hd3NfczNfb2JqZWN0LmxhbWJkYV9wYWNrYWdlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1lYjFjNmJiYy01NjQwLTYyZjUtOTNlZi0zZjBhYjhiZGRjNGYuemlwXVxubW9kdWxlLmp1bXBob3N0LmF3c19sYW1iZGFfZnVuY3Rpb24udXBkYXRlX2RuczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dXBkYXRlX2Ruc11cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZS5kZWZhdWx0X21haW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXItcnRiLTBkNzMzODNhZmViNmFkMTQyMTA4MDI4OTQ5NF1cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19uYXRfZ2F0ZXdheS5uYXRfZ3dbXCIxMC4wLjIuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9bmF0LTA4YjFjZDA2YjA0MzA5OWVjXVxubW9kdWxlLmp1bXBob3N0LmF3c19hdXRvc2NhbGluZ19ncm91cC5qdW1waG9zdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9anVtcGhvc3QtMjAyMzA3MTAwNDU1MTIxNjU0MDAwMDAwMDFdXG5tb2R1bGUubWFuYWdlbWVudC5hd3NfbmF0X2dhdGV3YXkubmF0X2d3W1wiMTAuMC4wLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPW5hdC0wOGZiOWI1MjY4MzI3Nzk0N11cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZV90YWJsZV9hc3NvY2lhdGlvbi5wcml2YXRlX3J0X2Fzc29jW1wiMTAuMC4yLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0YmFzc29jLTBlNzk1YmRhZWU2MjdhYTZjXVxubW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlX3RhYmxlX2Fzc29jaWF0aW9uLnByaXZhdGVfcnRfYXNzb2NbXCIxMC4wLjAuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiYXNzb2MtMDhhNDEwMTYwZTJkY2M1OTJdXG5tb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGVfdGFibGVfYXNzb2NpYXRpb24ucHJpdmF0ZV9ydF9hc3NvY1tcIjEwLjAuMS4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGJhc3NvYy0wOTliOTU4YWYxOTQ4NWYyYl1cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZV90YWJsZV9hc3NvY2lhdGlvbi5wcml2YXRlX3J0X2Fzc29jW1wiMTAuMC4zLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0YmFzc29jLTBiZjI3OGI2YTM5NGFlZDQ0XVxubW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlLnN1Ym5ldF9wdWJsaWNbXCIxMC4wLjAuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ci1ydGItMDRhMTZlNzRkNWIxMmEzMzgxMDgwMjg5NDk0XVxubW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlLnN1Ym5ldF9wdWJsaWNbXCIxMC4wLjIuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ci1ydGItMGJjNmM0NGMxYjI2ZmVkMjIxMDgwMjg5NDk0XVxubW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlLnN1Ym5ldF9wcml2YXRlW1wiMTAuMC4xLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXItcnRiLTA2N2MzMGU2NWRkNDEwOGU5MTA4MDI4OTQ5NF1cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZS5zdWJuZXRfcHJpdmF0ZVtcIjEwLjAuMy4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wMTc4ZTE3MThkZWJhNTFjZTEwODAyODk0OTRdXG5tb2R1bGUuanVtcGhvc3QuYXdzX2Nsb3Vkd2F0Y2hfZXZlbnRfcnVsZS5zY2FsZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9anVtcGhvc3Qtc2NhbGUyMDIzMDcxMTE3Mjc0NzUwNDcwMDAwMDAwMV1cbm1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmxhbWJkYS1wZXJtaXNzaW9uczogUmVhZGluZy4uLlxubW9kdWxlLmp1bXBob3N0LmF3c19hdXRvc2NhbGluZ19saWZlY3ljbGVfaG9vay5sYXVuY2hpbmc6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWxhdW5jaGluZ11cbm1vZHVsZS5qdW1waG9zdC5hd3NfYXV0b3NjYWxpbmdfbGlmZWN5Y2xlX2hvb2sudGVybWluYXRpbmc6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcm1pbmF0aW5nXVxubW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQubGFtYmRhLXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD01MDUyODA0MjldXG5tb2R1bGUuanVtcGhvc3QuYXdzX2lhbV9wb2xpY3kubGFtYmRhX3Blcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6NDkzMzcwODI2NDI0OnBvbGljeS9sYW1iZGFfcGVybWlzc2lvbnMyMDIzMDcxMTE2MDUxMjcyNDIwMDAwMDAwMV1cbm1vZHVsZS5qdW1waG9zdC5hd3NfY2xvdWR3YXRjaF9sb2dfZ3JvdXAudXBkYXRlX2RuczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9L2F3cy9sYW1iZGEvdXBkYXRlX2Ruc11cbm1vZHVsZS5qdW1waG9zdC5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQubGFtYmRhX3Blcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pYW1fZm9yX2xhbWJkYS0yMDIzMDcxMTE2MDUxMzQxNjEwMDAwMDAwMl1cbm1vZHVsZS5qdW1waG9zdC5hd3NfbGFtYmRhX3Blcm1pc3Npb24uYWxsb3dfY2xvdWR3YXRjaDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9QWxsb3dFeGVjdXRpb25Gcm9tQ2xvdWRXYXRjaC1vdXRdXG5tb2R1bGUuanVtcGhvc3QuYXdzX2Nsb3Vkd2F0Y2hfZXZlbnRfdGFyZ2V0LnNjYWxlLW91dDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9anVtcGhvc3Qtc2NhbGUyMDIzMDcxMTE3Mjc0NzUwNDcwMDAwMDAwMS10ZXJyYWZvcm0tMjAyMzA3MTExNzI3NDc2MzA5MDAwMDAwMDJdXG5tb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5sYW1iZGFfbG9nZ2luZzogUmVhZGluZy4uLlxubW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQubGFtYmRhX2xvZ2dpbmc6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTIyNjcxNDUzODJdXG5tb2R1bGUuanVtcGhvc3QuYXdzX2lhbV9wb2xpY3kubGFtYmRhX2xvZ2dpbmc6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjo0OTMzNzA4MjY0MjQ6cG9saWN5L2xhbWJkYV9sb2dnaW5nMjAyMzA3MTExNjA1MTM3NzgzMDAwMDAwMDNdXG5tb2R1bGUuanVtcGhvc3QuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmxhbWJkYV9sb2dzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pYW1fZm9yX2xhbWJkYS0yMDIzMDcxMTE2MDUxNDI1MTEwMDAwMDAwNF1cblxuVGVycmFmb3JtIHVzZWQgdGhlIHNlbGVjdGVkIHByb3ZpZGVycyB0byBnZW5lcmF0ZSB0aGUgZm9sbG93aW5nIGV4ZWN1dGlvblxucGxhbi4gUmVzb3VyY2UgYWN0aW9ucyBhcmUgaW5kaWNhdGVkIHdpdGggdGhlIGZvbGxvd2luZyBzeW1ib2xzOlxuICB+IHVwZGF0ZSBpbi1wbGFjZVxuLS8rIGRlc3Ryb3kgYW5kIHRoZW4gY3JlYXRlIHJlcGxhY2VtZW50XG4gPD0gcmVhZCAoZGF0YSByZXNvdXJjZXMpXG5cblRlcnJhZm9ybSB3aWxsIHBlcmZvcm0gdGhlIGZvbGxvd2luZyBhY3Rpb25zOlxuXG4gICMgbW9kdWxlLmp1bXBob3N0LmRhdGEuYXJjaGl2ZV9maWxlLmxhbWJkYSB3aWxsIGJlIHJlYWQgZHVyaW5nIGFwcGx5XG4gICMgKGRlcGVuZHMgb24gYSByZXNvdXJjZSBvciBhIG1vZHVsZSB3aXRoIGNoYW5nZXMgcGVuZGluZylcbiA8PSBkYXRhIFwiYXJjaGl2ZV9maWxlXCIgXCJsYW1iZGFcIiB7XG4gICAgICArIGV4Y2x1ZGVzICAgICAgICAgICAgPSBbXG4gICAgICAgICAgKyBcIl9fcHljYWNoZV9fXCIsXG4gICAgICAgIF1cbiAgICAgICsgaWQgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgb3V0cHV0X2Jhc2U2NHNoYTI1NiA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgb3V0cHV0X2Jhc2U2NHNoYTUxMiA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgb3V0cHV0X21kNSAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgb3V0cHV0X3BhdGggICAgICAgICA9IFwibW9kdWxlcy9qdW1waG9zdC9lYjFjNmJiYy01NjQwLTYyZjUtOTNlZi0zZjBhYjhiZGRjNGYuemlwXCJcbiAgICAgICsgb3V0cHV0X3NoYSAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgb3V0cHV0X3NoYTI1NiAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgb3V0cHV0X3NoYTUxMiAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgb3V0cHV0X3NpemUgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgc291cmNlX2RpciAgICAgICAgICA9IFwibW9kdWxlcy9qdW1waG9zdC91cGRhdGVfZG5zXCJcbiAgICAgICsgdHlwZSAgICAgICAgICAgICAgICA9IFwiemlwXCJcbiAgICB9XG5cbiAgIyBtb2R1bGUuanVtcGhvc3QuYXdzX2xhbWJkYV9mdW5jdGlvbi51cGRhdGVfZG5zIHdpbGwgYmUgdXBkYXRlZCBpbi1wbGFjZVxuICB+IHJlc291cmNlIFwiYXdzX2xhbWJkYV9mdW5jdGlvblwiIFwidXBkYXRlX2Ruc1wiIHtcbiAgICAgICAgaWQgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJ1cGRhdGVfZG5zXCJcbiAgICAgIH4gbGFzdF9tb2RpZmllZCAgICAgICAgICAgICAgICAgID0gXCIyMDIzLTA3LTE2VDAwOjMyOjEzLjAwMCswMDAwXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgfiBzM19rZXkgICAgICAgICAgICAgICAgICAgICAgICAgPSBcIjc3NWVjNjc2LWQyYzQtNDg4ZS00MTI5LTQ3YmMzOWM0YzQxNy56aXBcIiAtPiBcImViMWM2YmJjLTU2NDAtNjJmNS05M2VmLTNmMGFiOGJkZGM0Zi56aXBcIlxuICAgICAgICB0YWdzICAgICAgICAgICAgICAgICAgICAgICAgICAgPSB7fVxuICAgICAgICAjICgyMSB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pXG5cbiAgICAgICAgIyAoMyB1bmNoYW5nZWQgYmxvY2tzIGhpZGRlbilcbiAgICB9XG5cbiAgIyBtb2R1bGUuanVtcGhvc3QuYXdzX3MzX29iamVjdC5sYW1iZGFfcGFja2FnZSBpcyB0YWludGVkLCBzbyBtdXN0IGJlIHJlcGxhY2VkXG4tLysgcmVzb3VyY2UgXCJhd3NfczNfb2JqZWN0XCIgXCJsYW1iZGFfcGFja2FnZVwiIHtcbiAgICAgIH4gYnVja2V0X2tleV9lbmFibGVkICAgICA9IGZhbHNlIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4gY29udGVudF90eXBlICAgICAgICAgICA9IFwiYmluYXJ5L29jdGV0LXN0cmVhbVwiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4gZXRhZyAgICAgICAgICAgICAgICAgICA9IFwiZDljOWU1YWY2NDdjZTZlZGFmMmRjZjEyODlmN2EyOTQtM1wiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4gaWQgICAgICAgICAgICAgICAgICAgICA9IFwiZWIxYzZiYmMtNTY0MC02MmY1LTkzZWYtM2YwYWI4YmRkYzRmLnppcFwiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsga21zX2tleV9pZCAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIC0gbWV0YWRhdGEgICAgICAgICAgICAgICA9IHt9IC0+IG51bGxcbiAgICAgIH4gc2VydmVyX3NpZGVfZW5jcnlwdGlvbiA9IFwiQUVTMjU2XCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgfiBzdG9yYWdlX2NsYXNzICAgICAgICAgID0gXCJTVEFOREFSRFwiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIC0gdGFncyAgICAgICAgICAgICAgICAgICA9IHt9IC0+IG51bGxcbiAgICAgICsgdmVyc2lvbl9pZCAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgIyAoNiB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pXG4gICAgfVxuXG4gICMgbW9kdWxlLmp1bXBob3N0Lm51bGxfcmVzb3VyY2UuaW5zdGFsbF9weXRob25fZGVwZW5kZW5jaWVzIGlzIHRhaW50ZWQsIHNvIG11c3QgYmUgcmVwbGFjZWRcbi0vKyByZXNvdXJjZSBcIm51bGxfcmVzb3VyY2VcIiBcImluc3RhbGxfcHl0aG9uX2RlcGVuZGVuY2llc1wiIHtcbiAgICAgIH4gaWQgICAgICAgPSBcIjg4OTc0MTMwNzU5NTMxNTM0ODhcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgICMgKDEgdW5jaGFuZ2VkIGF0dHJpYnV0ZSBoaWRkZW4pXG4gICAgfVxuXG5QbGFuOiAyIHRvIGFkZCwgMSB0byBjaGFuZ2UsIDIgdG8gZGVzdHJveS5cblxuXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXG5cblNhdmVkIHRoZSBwbGFuIHRvOiB0Zi5wbGFuXG5cblRvIHBlcmZvcm0gZXhhY3RseSB0aGVzZSBhY3Rpb25zLCBydW4gdGhlIGZvbGxvd2luZyBjb21tYW5kIHRvIGFwcGx5OlxuICAgIHRlcnJhZm9ybSBhcHBseSBcInRmLnBsYW5cIlxuUmVsZWFzaW5nIHN0YXRlIGxvY2suIFRoaXMgbWF5IHRha2UgYSBmZXcgbW9tZW50cy4uLlxuOjpkZWJ1Zzo6VGVycmFmb3JtIGV4aXRlZCB3aXRoIGNvZGUgMC5cbjo6ZGVidWc6OnN0ZG91dDogbW9kdWxlLmp1bXBob3N0Lm51bGxfcmVzb3VyY2UuaW5zdGFsbF9weXRob25fZGVwZW5kZW5jaWVzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD04ODk3NDEzMDc1OTUzMTUzNDg4XSUwQW1vZHVsZS5qdW1waG9zdC5yYW5kb21fdXVpZC5sYW1kYV9zcmNfaGFzaDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ZWIxYzZiYmMtNTY0MC02MmY1LTkzZWYtM2YwYWI4YmRkYzRmXSUwQW1vZHVsZS5pbmZyYWhvdXNlX2NvbS5hd3Nfcm91dGU1M196b25lLmluZnJhaG91c2VfY29tOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0ddJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2FtaS51YnVudHVfMjI6IFJlYWRpbmcuLi4lMEFhd3Nfa2V5X3BhaXIuYWxla3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFsZWtzXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItcGVybWlzc2lvbnM6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF9wcm9maWxlLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lX3JvbGU6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19hdmFpbGFiaWxpdHlfem9uZXMudXcxOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuanVtcGhvc3RfcGVybWlzc2lvbnM6IFJlYWRpbmcuLi4lMEFtb2R1bGUuZ2l0aHViLWNvbm5lY3Rvci5hd3NfaWFtX29wZW5pZF9jb25uZWN0X3Byb3ZpZGVyLmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjQ5MzM3MDgyNjQyNDpvaWRjLXByb3ZpZGVyL3Rva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTM4OTQwNjg4MjZdJTBBbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF9wcm9maWxlLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xOTAzODQ5MzMxXSUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50Lmp1bXBob3N0X3Blcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xMTUyMjY1MTkyXSUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZV9yb2xlOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zNjkzNDQ1MDk3XSUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19pYW1fcG9saWN5LkFXU0xhbWJkYUJhc2ljRXhlY3V0aW9uUm9sZTogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2FtaS51YnVudHVfMjI6IFJlYWRpbmcuLi4lMEFtb2R1bGUuanVtcGhvc3QuYXdzX3MzX2J1Y2tldC5sYW1iZGFfdG1wOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWp1bXBob3N0LWxhbWJkYS0yMDIzMDcxMzIzMzQ1OTY3NTgwMDAwMDAwMV0lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfY2FsbGVyX2lkZW50aXR5LmN1cnJlbnQ6IFJlYWRpbmcuLi4lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfY2FsbGVyX2lkZW50aXR5LmN1cnJlbnQ6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQ5MzM3MDgyNjQyNF0lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfcmVnaW9uLmN1cnJlbnQ6IFJlYWRpbmcuLi4lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfcmVnaW9uLmN1cnJlbnQ6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPXVzLXdlc3QtMV0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3NfdnBjLnZwYzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dnBjLTA4ZTE5ZDg1OWMyNmQxOGIyXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZGluZy4uLiUwQW1vZHVsZS5qdW1waG9zdC5tb2R1bGUuanVtcGhvc3RfcHJvZmlsZS5hd3NfaWFtX3JvbGUucHJvZmlsZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9anVtcGhvc3QyMDIzMDcxMDA0MzA0NDc2MTAwMDAwMDAwMl0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2lhbV9yb2xlLmlhbV9mb3JfbGFtYmRhOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pYW1fZm9yX2xhbWJkYV0lMEFkYXRhLmF3c19hdmFpbGFiaWxpdHlfem9uZXMudXcxOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD11cy13ZXN0LTFdJTBBbW9kdWxlLmluZnJhaG91c2VfY29tLmF3c19yb3V0ZTUzX3JlY29yZC50eHRfZGtpbTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHX2dvb2dsZS5fZG9tYWlua2V5LmluZnJhaG91c2UuY29tX1RYVF0lMEFkYXRhLmF3c19hbWkudWJ1bnR1XzIyOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hbWktMDc5MzQ1MmRmODhkMzNjNjNdJTBBbW9kdWxlLmluZnJhaG91c2VfY29tLmF3c19yb3V0ZTUzX3JlY29yZC5zcGY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR19pbmZyYWhvdXNlLmNvbV9TUEZdJTBBbW9kdWxlLmluZnJhaG91c2VfY29tLmF3c19yb3V0ZTUzX3JlY29yZC5teDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHX2luZnJhaG91c2UuY29tX01YXSUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19hbWkudWJ1bnR1XzIyOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hbWktMDc5MzQ1MmRmODhkMzNjNjNdJTBBbW9kdWxlLmluZnJhaG91c2VfY29tLmF3c19yb3V0ZTUzX3JlY29yZC50eHRfc3BmOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfaW5mcmFob3VzZS5jb21fVFhUXSUwQW1vZHVsZS5qdW1waG9zdC5tb2R1bGUuanVtcGhvc3RfcHJvZmlsZS5hd3NfaWFtX3BvbGljeS5wcm9maWxlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6NDkzMzcwODI2NDI0OnBvbGljeS9qdW1waG9zdDIwMjMwNzEwMDQzMDQ0NzYwNDAwMDAwMDAxXSUwQW1vZHVsZS5qdW1waG9zdC5tb2R1bGUuanVtcGhvc3RfcHJvZmlsZS5hd3NfaWFtX2luc3RhbmNlX3Byb2ZpbGUucHJvZmlsZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9anVtcGhvc3RdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1hc3N1bWU6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzkxMTg0NDg2OF0lMEFtb2R1bGUuanVtcGhvc3QubW9kdWxlLmp1bXBob3N0X3Byb2ZpbGUuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50Lmp1bXBob3N0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1qdW1waG9zdDIwMjMwNzEwMDQzMDQ0NzYxMDAwMDAwMDAyLTIwMjMwNzEwMDQzMDQ1NzgxMTAwMDAwMDAzXSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19laXAubmF0X2VpcFtcIjEwLjAuMC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1laXBhbGxvYy0wMmI0MmU3MGQ1MmE1ZGI3Zl0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3NfZWlwLm5hdF9laXBbXCIxMC4wLjIuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ZWlwYWxsb2MtMDE2MDM1MjQ2YjQ5MTAyYjVdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5hd3NfaWFtX3JvbGUuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtZ2l0aHViXSUwQW1vZHVsZS5qdW1waG9zdC5hd3NfbGF1bmNoX3RlbXBsYXRlLmp1bXBob3N0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1sdC0wMWE4ZWY5NjgyMmI0YjAwYl0lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfaWFtX3BvbGljeS5BV1NMYW1iZGFCYXNpY0V4ZWN1dGlvblJvbGU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L3NlcnZpY2Utcm9sZS9BV1NMYW1iZGFCYXNpY0V4ZWN1dGlvblJvbGVdJTBBbW9kdWxlLmp1bXBob3N0LmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5BV1NMYW1iZGFCYXNpY0V4ZWN1dGlvblJvbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWlhbV9mb3JfbGFtYmRhLTIwMjMwNzEwMTc1NDM0ODc4MDAwMDAwMDAxXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hZG1pbi1hc3N1bWU6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYWRtaW4tYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xMzgyOTM3MTY5XSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uYXdzX2lhbV9yb2xlLmFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW5dJTBBZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc10lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuYWRtaW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi0yMDIzMDcwOTE2NDMyMTMxOTkwMDAwMDAwMV0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfc3VibmV0LmFsbFtcIjEwLjAuMy4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zdWJuZXQtMGNmZmZhY2EzMjVkOTM4MjddJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlX3RhYmxlLmFsbFtcIjEwLjAuMC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMDRhMTZlNzRkNWIxMmEzMzhdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlX3RhYmxlLmFsbFtcIjEwLjAuMy4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMDE3OGUxNzE4ZGViYTUxY2VdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3N1Ym5ldC5hbGxbXCIxMC4wLjEuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c3VibmV0LTBmOTFkZDI2NzVlN2ExNmMzXSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19zdWJuZXQuYWxsW1wiMTAuMC4wLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXN1Ym5ldC0wZGY4ODVkY2M5OTQxODc5OV0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3NfaW50ZXJuZXRfZ2F0ZXdheS5pZzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWd3LTA3OTA5MGUwOWVkNWRiNTgyXSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19kZWZhdWx0X3NlY3VyaXR5X2dyb3VwLmRlZmF1bHQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnLTA4Yjk2MGI4NWY1OTk2MTAwXSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19zdWJuZXQuYWxsW1wiMTAuMC4yLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXN1Ym5ldC0wODNlOTY5ZGMzNzc5YWYyNl0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3NfZGVmYXVsdF9yb3V0ZV90YWJsZS5kZWZhdWx0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMGQ3MzM4M2FmZWI2YWQxNDJdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlX3RhYmxlLmFsbFtcIjEwLjAuMS4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMDY3YzMwZTY1ZGQ0MTA4ZTldJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlX3RhYmxlLmFsbFtcIjEwLjAuMi4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMGJjNmM0NGMxYjI2ZmVkMjJdJTBBbW9kdWxlLmp1bXBob3N0LmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5wdWJsaWNfYWNjZXNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWp1bXBob3N0LWxhbWJkYS0yMDIzMDcxMzIzMzQ1OTY3NTgwMDAwMDAwMV0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX3MzX29iamVjdC5sYW1iZGFfcGFja2FnZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ZWIxYzZiYmMtNTY0MC02MmY1LTkzZWYtM2YwYWI4YmRkYzRmLnppcF0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2xhbWJkYV9mdW5jdGlvbi51cGRhdGVfZG5zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD11cGRhdGVfZG5zXSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZS5kZWZhdWx0X21haW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXItcnRiLTBkNzMzODNhZmViNmFkMTQyMTA4MDI4OTQ5NF0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3NfbmF0X2dhdGV3YXkubmF0X2d3W1wiMTAuMC4yLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPW5hdC0wOGIxY2QwNmIwNDMwOTllY10lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2F1dG9zY2FsaW5nX2dyb3VwLmp1bXBob3N0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1qdW1waG9zdC0yMDIzMDcxMDA0NTUxMjE2NTQwMDAwMDAwMV0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3NfbmF0X2dhdGV3YXkubmF0X2d3W1wiMTAuMC4wLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPW5hdC0wOGZiOWI1MjY4MzI3Nzk0N10lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGVfdGFibGVfYXNzb2NpYXRpb24ucHJpdmF0ZV9ydF9hc3NvY1tcIjEwLjAuMi4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGJhc3NvYy0wZTc5NWJkYWVlNjI3YWE2Y10lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGVfdGFibGVfYXNzb2NpYXRpb24ucHJpdmF0ZV9ydF9hc3NvY1tcIjEwLjAuMC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGJhc3NvYy0wOGE0MTAxNjBlMmRjYzU5Ml0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGVfdGFibGVfYXNzb2NpYXRpb24ucHJpdmF0ZV9ydF9hc3NvY1tcIjEwLjAuMS4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGJhc3NvYy0wOTliOTU4YWYxOTQ4NWYyYl0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGVfdGFibGVfYXNzb2NpYXRpb24ucHJpdmF0ZV9ydF9hc3NvY1tcIjEwLjAuMy4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGJhc3NvYy0wYmYyNzhiNmEzOTRhZWQ0NF0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGUuc3VibmV0X3B1YmxpY1tcIjEwLjAuMC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wNGExNmU3NGQ1YjEyYTMzODEwODAyODk0OTRdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlLnN1Ym5ldF9wdWJsaWNbXCIxMC4wLjIuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ci1ydGItMGJjNmM0NGMxYjI2ZmVkMjIxMDgwMjg5NDk0XSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZS5zdWJuZXRfcHJpdmF0ZVtcIjEwLjAuMS4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wNjdjMzBlNjVkZDQxMDhlOTEwODAyODk0OTRdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlLnN1Ym5ldF9wcml2YXRlW1wiMTAuMC4zLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXItcnRiLTAxNzhlMTcxOGRlYmE1MWNlMTA4MDI4OTQ5NF0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2Nsb3Vkd2F0Y2hfZXZlbnRfcnVsZS5zY2FsZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9anVtcGhvc3Qtc2NhbGUyMDIzMDcxMTE3Mjc0NzUwNDcwMDAwMDAwMV0lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5sYW1iZGEtcGVybWlzc2lvbnM6IFJlYWRpbmcuLi4lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2F1dG9zY2FsaW5nX2xpZmVjeWNsZV9ob29rLmxhdW5jaGluZzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9bGF1bmNoaW5nXSUwQW1vZHVsZS5qdW1waG9zdC5hd3NfYXV0b3NjYWxpbmdfbGlmZWN5Y2xlX2hvb2sudGVybWluYXRpbmc6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcm1pbmF0aW5nXSUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmxhbWJkYS1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NTA1MjgwNDI5XSUwQW1vZHVsZS5qdW1waG9zdC5hd3NfaWFtX3BvbGljeS5sYW1iZGFfcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjo0OTMzNzA4MjY0MjQ6cG9saWN5L2xhbWJkYV9wZXJtaXNzaW9uczIwMjMwNzExMTYwNTEyNzI0MjAwMDAwMDAxXSUwQW1vZHVsZS5qdW1waG9zdC5hd3NfY2xvdWR3YXRjaF9sb2dfZ3JvdXAudXBkYXRlX2RuczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9L2F3cy9sYW1iZGEvdXBkYXRlX2Ruc10lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmxhbWJkYV9wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWFtX2Zvcl9sYW1iZGEtMjAyMzA3MTExNjA1MTM0MTYxMDAwMDAwMDJdJTBBbW9kdWxlLmp1bXBob3N0LmF3c19sYW1iZGFfcGVybWlzc2lvbi5hbGxvd19jbG91ZHdhdGNoOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1BbGxvd0V4ZWN1dGlvbkZyb21DbG91ZFdhdGNoLW91dF0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2Nsb3Vkd2F0Y2hfZXZlbnRfdGFyZ2V0LnNjYWxlLW91dDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9anVtcGhvc3Qtc2NhbGUyMDIzMDcxMTE3Mjc0NzUwNDcwMDAwMDAwMS10ZXJyYWZvcm0tMjAyMzA3MTExNzI3NDc2MzA5MDAwMDAwMDJdJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQubGFtYmRhX2xvZ2dpbmc6IFJlYWRpbmcuLi4lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5sYW1iZGFfbG9nZ2luZzogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjI2NzE0NTM4Ml0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2lhbV9wb2xpY3kubGFtYmRhX2xvZ2dpbmc6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjo0OTMzNzA4MjY0MjQ6cG9saWN5L2xhbWJkYV9sb2dnaW5nMjAyMzA3MTExNjA1MTM3NzgzMDAwMDAwMDNdJTBBbW9kdWxlLmp1bXBob3N0LmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5sYW1iZGFfbG9nczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWFtX2Zvcl9sYW1iZGEtMjAyMzA3MTExNjA1MTQyNTExMDAwMDAwMDRdJTBBJTBBVGVycmFmb3JtIHVzZWQgdGhlIHNlbGVjdGVkIHByb3ZpZGVycyB0byBnZW5lcmF0ZSB0aGUgZm9sbG93aW5nIGV4ZWN1dGlvbiUwQXBsYW4uIFJlc291cmNlIGFjdGlvbnMgYXJlIGluZGljYXRlZCB3aXRoIHRoZSBmb2xsb3dpbmcgc3ltYm9sczolMEEgIH4gdXBkYXRlIGluLXBsYWNlJTBBLS8rIGRlc3Ryb3kgYW5kIHRoZW4gY3JlYXRlIHJlcGxhY2VtZW50JTBBIDw9IHJlYWQgKGRhdGEgcmVzb3VyY2VzKSUwQSUwQVRlcnJhZm9ybSB3aWxsIHBlcmZvcm0gdGhlIGZvbGxvd2luZyBhY3Rpb25zOiUwQSUwQSAgIyBtb2R1bGUuanVtcGhvc3QuZGF0YS5hcmNoaXZlX2ZpbGUubGFtYmRhIHdpbGwgYmUgcmVhZCBkdXJpbmcgYXBwbHklMEEgICMgKGRlcGVuZHMgb24gYSByZXNvdXJjZSBvciBhIG1vZHVsZSB3aXRoIGNoYW5nZXMgcGVuZGluZyklMEEgPD0gZGF0YSBcImFyY2hpdmVfZmlsZVwiIFwibGFtYmRhXCIgeyUwQSAgICAgICsgZXhjbHVkZXMgICAgICAgICAgICA9IFslMEEgICAgICAgICAgKyBcIl9fcHljYWNoZV9fXCIsJTBBICAgICAgICBdJTBBICAgICAgKyBpZCAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgb3V0cHV0X2Jhc2U2NHNoYTI1NiA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG91dHB1dF9iYXNlNjRzaGE1MTIgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBvdXRwdXRfbWQ1ICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgb3V0cHV0X3BhdGggICAgICAgICA9IFwibW9kdWxlcy9qdW1waG9zdC9lYjFjNmJiYy01NjQwLTYyZjUtOTNlZi0zZjBhYjhiZGRjNGYuemlwXCIlMEEgICAgICArIG91dHB1dF9zaGEgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBvdXRwdXRfc2hhMjU2ICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgb3V0cHV0X3NoYTUxMiAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG91dHB1dF9zaXplICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBzb3VyY2VfZGlyICAgICAgICAgID0gXCJtb2R1bGVzL2p1bXBob3N0L3VwZGF0ZV9kbnNcIiUwQSAgICAgICsgdHlwZSAgICAgICAgICAgICAgICA9IFwiemlwXCIlMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuanVtcGhvc3QuYXdzX2xhbWJkYV9mdW5jdGlvbi51cGRhdGVfZG5zIHdpbGwgYmUgdXBkYXRlZCBpbi1wbGFjZSUwQSAgfiByZXNvdXJjZSBcImF3c19sYW1iZGFfZnVuY3Rpb25cIiBcInVwZGF0ZV9kbnNcIiB7JTBBICAgICAgICBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcInVwZGF0ZV9kbnNcIiUwQSAgICAgIH4gbGFzdF9tb2RpZmllZCAgICAgICAgICAgICAgICAgID0gXCIyMDIzLTA3LTE2VDAwOjMyOjEzLjAwMCswMDAwXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIH4gczNfa2V5ICAgICAgICAgICAgICAgICAgICAgICAgID0gXCI3NzVlYzY3Ni1kMmM0LTQ4OGUtNDEyOS00N2JjMzljNGM0MTcuemlwXCIgLT4gXCJlYjFjNmJiYy01NjQwLTYyZjUtOTNlZi0zZjBhYjhiZGRjNGYuemlwXCIlMEEgICAgICAgIHRhZ3MgICAgICAgICAgICAgICAgICAgICAgICAgICA9IHt9JTBBICAgICAgICAjICgyMSB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pJTBBJTBBICAgICAgICAjICgzIHVuY2hhbmdlZCBibG9ja3MgaGlkZGVuKSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5qdW1waG9zdC5hd3NfczNfb2JqZWN0LmxhbWJkYV9wYWNrYWdlIGlzIHRhaW50ZWQsIHNvIG11c3QgYmUgcmVwbGFjZWQlMEEtLysgcmVzb3VyY2UgXCJhd3NfczNfb2JqZWN0XCIgXCJsYW1iZGFfcGFja2FnZVwiIHslMEEgICAgICB+IGJ1Y2tldF9rZXlfZW5hYmxlZCAgICAgPSBmYWxzZSAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgfiBjb250ZW50X3R5cGUgICAgICAgICAgID0gXCJiaW5hcnkvb2N0ZXQtc3RyZWFtXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIH4gZXRhZyAgICAgICAgICAgICAgICAgICA9IFwiZDljOWU1YWY2NDdjZTZlZGFmMmRjZjEyODlmN2EyOTQtM1wiIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICB+IGlkICAgICAgICAgICAgICAgICAgICAgPSBcImViMWM2YmJjLTU2NDAtNjJmNS05M2VmLTNmMGFiOGJkZGM0Zi56aXBcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBrbXNfa2V5X2lkICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIC0gbWV0YWRhdGEgICAgICAgICAgICAgICA9IHt9IC0+IG51bGwlMEEgICAgICB+IHNlcnZlcl9zaWRlX2VuY3J5cHRpb24gPSBcIkFFUzI1NlwiIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICB+IHN0b3JhZ2VfY2xhc3MgICAgICAgICAgPSBcIlNUQU5EQVJEXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIC0gdGFncyAgICAgICAgICAgICAgICAgICA9IHt9IC0+IG51bGwlMEEgICAgICArIHZlcnNpb25faWQgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgICAjICg2IHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbiklMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuanVtcGhvc3QubnVsbF9yZXNvdXJjZS5pbnN0YWxsX3B5dGhvbl9kZXBlbmRlbmNpZXMgaXMgdGFpbnRlZCwgc28gbXVzdCBiZSByZXBsYWNlZCUwQS0vKyByZXNvdXJjZSBcIm51bGxfcmVzb3VyY2VcIiBcImluc3RhbGxfcHl0aG9uX2RlcGVuZGVuY2llc1wiIHslMEEgICAgICB+IGlkICAgICAgID0gXCI4ODk3NDEzMDc1OTUzMTUzNDg4XCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICAgIyAoMSB1bmNoYW5nZWQgYXR0cmlidXRlIGhpZGRlbiklMEEgICAgfSUwQSUwQVBsYW46IDIgdG8gYWRkLCAxIHRvIGNoYW5nZSwgMiB0byBkZXN0cm95LiUwQSUwQVx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMCUwQSUwQVNhdmVkIHRoZSBwbGFuIHRvOiB0Zi5wbGFuJTBBJTBBVG8gcGVyZm9ybSBleGFjdGx5IHRoZXNlIGFjdGlvbnMsIHJ1biB0aGUgZm9sbG93aW5nIGNvbW1hbmQgdG8gYXBwbHk6JTBBICAgIHRlcnJhZm9ybSBhcHBseSBcInRmLnBsYW5cIiUwQVJlbGVhc2luZyBzdGF0ZSBsb2NrLiBUaGlzIG1heSB0YWtlIGEgZmV3IG1vbWVudHMuLi4lMEFcbjo6ZGVidWc6OnN0ZGVycjogXG46OmRlYnVnOjpleGl0Y29kZTogMFxuIiwgInN0ZGVyciI6ICIiLCAiYWRkIjogMiwgImNoYW5nZSI6IDEsICJkZXN0cm95IjogMn19```
</p></details>